[
    {
        "title": "Garbage Disposal Maintenance Tips &amp; Tricks",
        "img": "",
        "body": "<p>Proper maintenance and operation will extend the life of your garbage disposal and prevent plumbing and drain mishaps.<\/p><br \/><p>If you have a garbage disposal in your kitchen, you know that it’s a great appliance that makes household duties less demanding. But if not operated or maintained properly, a garbage disposal can easily break down, block and clog the drains and cause a long list of expensive plumbing and drain nightmares. Fortunately, most garbage disposal troubles are completely unnecessary, and garbage disposal care and maintenance is extremely easy. Below are some tips and tricks to maintain your garbage disposal.<\/p><br \/><h3>Tricks:<\/h3><br\/><ul><li>To keep your garbage disposal clean. Pour a little dish soap inside and let the garbage disposal run for a minute or so with some cold water after washing dishes.<\/li><li>Run your garbage disposal regularly. Frequent use prevents rust and corrosion, assures that all parts stay moving and prevents obstructions from accumulating.<\/li><li>Grind food waste with a strong flow of water.<\/li><li>Grind a few hard materials such as small chicken and fish bones, egg shells, small fruit pits and or seeds. This creates a scouring action in which the particles inside the grind chamber that cleans the garbage disposal’s walls.<\/li><li>Grind the peels from citrus fruits such as lemons or oranges to freshen up drain smells.<\/li><li>Cut large items into smaller pieces. Put them into the garbage disposal one at a time instead of trying to shove a large amount in at once.<\/li><\/ul><br \/><h3>Tips:<\/h3><br \/><ul><li>Never grind glass, plastic, metal or even paper.<\/li><li>Never grind anything combustible.<\/li><li>Never grind cigarette butts.<\/li><li>Do not pour grease, oil or fat into your garbage disposal or drain. Grease will slowly build up and clog drains causing plumbing issues.<\/li><li>You should not grind extremely fibrous material like corn husks, celery stalks, onion skins, and artichokes. Fibers from these can tangle and jam the garbage disposal motor and block drains.<\/li><li>You should not turn off the motor or water until grinding is completed. When grinding is complete, turn off the the garbage disposal first. Let water continue to run for at least 10 seconds, flushing out any remaining particles. Then turn off water.<\/li><li>Never put potato peels down the garbage disposal. The starches in the potatoes will turn into a thick paste and may cause blades to stick and can also cause drain clogs even when ground up.<\/li><li>We do not recommend you use harsh chemicals like bleach or drain cleaners. They can damage blades and pipes.<\/li><li>Ice is an extremely effective and inexpensive method for cleaning your garbage disposal, sharpening the blades and breaking up any grease build-up which has accumulated. Just toss a few ice cubes into the garbage disposal and run it. As the garbage disposal chops into the ice cubes, the ice chips will effectively scour all the hard to reach areas of the unit, and melt down the drain. Try this once or twice a month to keep your garbage disposal in fine working order.<\/li><li>Occasionally, take a lemon or orange and toss it into the disposal. The oils and juice from the fruits and peels naturally clean the walls inside the garbage disposal and create a fresh, long-lasting scent.<\/li><li>Freeze vinegar in ice cube trays and run those down the disposal. This will keep your blades sharp while safely killing odor-causing bacteria.<\/li><li><strong>NEVER, EVER<\/strong> insert your hand into the garbage disposal.  Always unplug the unit or turn off the appropriate circuit breaker first. Accidents happen, and you do not want this accident to happen.<\/li><\/ul><br \/><h3>What to do if your garbage disposal isn't working:<\/h3><br \/><ul><li>90% of garbage disposals that appear not to be working just need to be reset. There is usually a red or black reset button on the garbage disposal motor underneath your sink. Just push to reset.<\/li><li>If the garbage disposal is plugged into a wall outlet, ensure the outlet has power.<\/li><li>Check for a blown fuse or tripped circuit breaker.<\/li><li>Give it a push-start. Most garbage disposals have a hole underneath that allows you to hand-crank it free once it’s been jammed. To crank it, use either an Alan wrench or a garbage disposal tool.<\/li><\/ul><br \/><p>If the above action do not work for you give us a call. We have the tools, and know how to address almost every garbage disposal emergency. Bizzy B Plumbing & Home Improvement are your Knoxville Plumbers to call.<\/p>"
    },
    {
        "title": "Reverse Osmosis Water Filters Installed",
        "img": "",
        "body": "<p>This is a recent install of a reverse osmosis water filter system and a new Garbage disposal. We can install all types of water filter systems in your home, from under sink to whole home systems. We can replace or add garbage disposals to most sinks quickly and with out a great deal of plumbing modifications. Call us for a free quote and get great tasting water for much cheaper than purchasing bottled water.<\/p>"
    },
    {
        "title": "Plumbing Leaks Can Cost You Big",
        "img": "",
        "body": "<h1>Body<\/h1>"
    },
    {
        "title": "<h1>Body<\/h1>",
        "img": "",
        "body": "<h1>Body<\/h1>"
    },
    {
        "title": "<h1>Body<\/h1>",
        "img": "",
        "body": "<h1>Body<\/h1>"
    }
]