[
    {
        "title": "Garbage Disposal Maintenance Tips & Tricks",
        "img": "resources/images/blog/garbageDisposal.jpg",
        "body": "<p>Proper maintenance and operation will extend the life of your garbage disposal and prevent plumbing and drain mishaps.</p><br /><p>If you have a garbage disposal in your kitchen, you know that it’s a great appliance that makes household duties less demanding. But if not operated or maintained properly, a garbage disposal can easily break down, block and clog the drains and cause a long list of expensive plumbing and drain nightmares. Fortunately, most garbage disposal troubles are completely unnecessary, and garbage disposal care and maintenance is extremely easy. Below are some tips and tricks to maintain your garbage disposal.</p><br /><h3>Tricks:</h3><br/><ul><li>To keep your garbage disposal clean. Pour a little dish soap inside and let the garbage disposal run for a minute or so with some cold water after washing dishes.</li><li>Run your garbage disposal regularly. Frequent use prevents rust and corrosion, assures that all parts stay moving and prevents obstructions from accumulating.</li><li>Grind food waste with a strong flow of water.</li><li>Grind a few hard materials such as small chicken and fish bones, egg shells, small fruit pits and or seeds. This creates a scouring action in which the particles inside the grind chamber that cleans the garbage disposal’s walls.</li><li>Grind the peels from citrus fruits such as lemons or oranges to freshen up drain smells.</li><li>Cut large items into smaller pieces. Put them into the garbage disposal one at a time instead of trying to shove a large amount in at once.</li></ul><br /><h3>Tips:</h3><br /><ul><li>Never grind glass, plastic, metal or even paper.</li><li>Never grind anything combustible.</li><li>Never grind cigarette butts.</li><li>Do not pour grease, oil or fat into your garbage disposal or drain. Grease will slowly build up and clog drains causing plumbing issues.</li><li>You should not grind extremely fibrous material like corn husks, celery stalks, onion skins, and artichokes. Fibers from these can tangle and jam the garbage disposal motor and block drains.</li><li>You should not turn off the motor or water until grinding is completed. When grinding is complete, turn off the the garbage disposal first. Let water continue to run for at least 10 seconds, flushing out any remaining particles. Then turn off water.</li><li>Never put potato peels down the garbage disposal. The starches in the potatoes will turn into a thick paste and may cause blades to stick and can also cause drain clogs even when ground up.</li><li>We do not recommend you use harsh chemicals like bleach or drain cleaners. They can damage blades and pipes.</li><li>Ice is an extremely effective and inexpensive method for cleaning your garbage disposal, sharpening the blades and breaking up any grease build-up which has accumulated. Just toss a few ice cubes into the garbage disposal and run it. As the garbage disposal chops into the ice cubes, the ice chips will effectively scour all the hard to reach areas of the unit, and melt down the drain. Try this once or twice a month to keep your garbage disposal in fine working order.</li><li>Occasionally, take a lemon or orange and toss it into the disposal. The oils and juice from the fruits and peels naturally clean the walls inside the garbage disposal and create a fresh, long-lasting scent.</li><li>Freeze vinegar in ice cube trays and run those down the disposal. This will keep your blades sharp while safely killing odor-causing bacteria.</li><li><strong>NEVER, EVER</strong> insert your hand into the garbage disposal.  Always unplug the unit or turn off the appropriate circuit breaker first. Accidents happen, and you do not want this accident to happen.</li></ul><br /><h3>What to do if your garbage disposal isn't working:</h3><br /><ul><li>90% of garbage disposals that appear not to be working just need to be reset. There is usually a red or black reset button on the garbage disposal motor underneath your sink. Just push to reset.</li><li>If the garbage disposal is plugged into a wall outlet, ensure the outlet has power.</li><li>Check for a blown fuse or tripped circuit breaker.</li><li>Give it a push-start. Most garbage disposals have a hole underneath that allows you to hand-crank it free once it’s been jammed. To crank it, use either an Alan wrench or a garbage disposal tool.</li></ul><br /><p>If the above action do not work for you give us a call. We have the tools, and know how to address almost every garbage disposal emergency. Bizzy B Plumbing & Home Improvement are your Knoxville Plumbers to call.</p>"
    },
    {
        "title": "Reverse Osmosis Water Filters Installed",
        "img": "resources/images/blog/RO-Install-Photo.jpg",
        "body": "<p>This is a recent install of a reverse osmosis water filter system and a new Garbage disposal. We can install all types of water filter systems in your home, from under sink to whole home systems. We can replace or add garbage disposals to most sinks quickly and with out a great deal of plumbing modifications. Call us for a free quote and get great tasting water for much cheaper than purchasing bottled water.</p>"
    },
    {
        "title": "3 Things You Should Never Buy at Home Improvement Stores",
        "img": "resources/images/blog/plumbing-not-to-use-150x150.jpg",
        "body": "<p>Big box home improvement stores in Knoxville and Maryville are very useful for even the most inexperienced of homeowners. They give you the ability to make your own repairs. On the other hand, big box home improvement stores can be terrible because it gives you the ability to make your own repairs.</p><br /><p>Professional home inspectors are taught that water/moisture and termites are the number one enemy to homes. This is not the case. Experienced professional home inspectors learn quickly that a homeowner is the number one enemy to their home. Time after time the most dangerous issues detected in home inspections are the result of the homeowner attempting a repair.</p><br /><p>But we have found that some of the blame should be passed on to the big box home improvement stores for offering homeowners repair and replacement products that are dangerous and not up to local building codes.</p><br /><p>Here are 3 things you should never purchase from a home improvement or hardware store.</p><br /><ol><li>Double keyed deadbolts:</li><ul><li>Even though these are sometimes advised for use by security companies for added security, they can be a fire safety hazard. Because you need a key to lock and unlock from both inside and outside the extra time in an emergency can be fatal. If a fire was to happen in your home and smoke fills the air, it can be very difficult to locate the keys and make it back to unlock the door before being overcome by the smoke.</li></ul><li>Screened and/or Plastic Dryer Vents:</li><ul><li>It is troublesome that these items are still being sold. Lint is flammable! When screens are installed on the dryer vent, it creates a hazard. Building codes in Knoxville and Maryville are clear on this, no screens are allowed on the dryer vent end or termination. If your home has one, call us asap to have it replaced.</li><li>Dryer vent safety is not something to take lightly. The CPSC (<i>Consumer Product Safety Commission</i>) estimates that over 15,000 dryer fires are take place every year. A plastic dryer vent will quickly melt and allow the flame to spread through out the home and outside walls.</li><li>Even though metal dryer vents will not stop the fire from spreading, they do allow more time to detect, evacuate, and extinguish the fire. Plastic dryer vents have no place in a home. If you have any of these issues Bizzy B Plumbing & Home Improvement can “B” there for you. We will fix it correctly and safely.</li></ul><li>Corrugated Plumbing:</li><ul><li>When you are frustrated with a tough DIY (do it yourself) plumbing repair, you may be tempted to purchase some flexible, corrugated, accordion like plumbing materials. Do not be tempted.</li><li>This type of plumbing is not approved for your home’s drainage system. It has absolutely no use in the home. To make matters worse, most homeowners install it in a way that does not create a proper drain trap.</li><li>Drain traps prevent smelly, dangerous gas from the sewer from entering your home, so installing this type of plumbing can be a real safety concern. Call us, as we are certified and experienced in plumbing of all types. We can fix the issues you are having faster, and less expensive than you think.</li></ul></ol>"
    },
    {
        "title": "Plumbing Leaks Can Cost You Big",
        "img": "resources/images/blog/plumbingDamage.jpg",
        "body": "<p>Your homes plumbing, under sink, behind shower/bathtub, is part of an simple,necessary network to bring water to your fixtures. This network of pipes andvalves require some maintenance and sometimes may require emergency help torepair a leak and prevent severe damage in your home. If a leak is unnoticedor ignored, the potential costs of the plumbing leaks are significant. Beloware a few tips and good information to help you along.</p><br /><h3>Look and listen for leaks:</h3><br /><ol><li>Your first step to keep the cost of damage low is being attentive in your home. Try to keep an eye out for pooling water or wet spots. The quicker you can spot a water leak, the damage to drywall, flooring and fixtures will be greatly diminished.</li><li>Listen for hissing or drips at when the house is quiet particularly at night before bed.</li><li>Watch for signs of leaks in the bath or shower usually signaled by low water pressure, colored water or slow drains.</li><li>Another indicator is, if you notice excess water on the floor, loose tiles in the tub/ shower surround or warped walls.</li></ol><br /><h3>Water damage costs</h3><br /><ul><li><strong>Walls: </strong>If unnoticed or ignored, a water leak will cause damage to your walls. When pipes running behind walls burst or begin to leak, the drywall gets wet and can eventually this moisture produces wet spots, mold, mildew, and worse. Leaks in the bathroom are easy to miss, especially if you love steamy showers or hot baths. If you notice constant wetness and/or a musty smell, you very well could have a leak. Bizzy B Plumbing & Home Improvement can fix the problem and, if the problem is still in its early stages save you large amounts of time and money. If left untreated or repaired it can lead to costly replacement of walls and the potential of Black Mold can set in, requiring specialists. This can and will be very costly. For Example, 100 sq ft of drywall may cost as much as $600 to replace, while mold remediation can run anywhere from $1000 to $3000 for the same area.</li><li><strong>Flooring: </strong>Another area of concern for damage is flooring and fixtures. Water always moves to the lowest area it can get to, which means, leaks in a kitchen and bathroom will pool on and then under your floors. Indicators of bathroom floor damage can be loose tiles at the tub/shower edge or in the middle of the floor. In your kitchen look for warping/discolored wood, wrinkled linoleum, or loose floor tiles. Particularly near the dishwasher, fridge, or sink cabinet. Hardwood flooring can cost between $10 and $35 per square foot to replace. Replacing single tiles is not expensive as long as they are still available, but the costs  soar if the sub floor of your bathroom or kitchen becomes damaged. Removing and replacing swelled floorboards and installing new tile may cost anywhere from $1000 to $3000. Hardwood replacement cost is even more, while the cost for linoleum replacement is moderate.</li><li><strong>Fixtures: </strong>Leaks or water quality issues can also cause damage to your plumbing fixtures like faucets and shower heads. In some cases, the fixtures may stop working, if a rubber gasket decays and becomes stuck in the line and or may cause severely reduced water pressure. If not repaired, replacement may be the only option. Average  cost for faucets being between $75 – $500, depending on the brand/style of fixture.</li></ul><br /><p>Keeping your repair costs low is easier than you think. Avoid high costs for repair by simply watching for potential issues. If you see any of the indicators listed above, Call us at 865-591-8500 and let Bizzy B Plumbing be there for you. Water leaks are always better tackled immediately, the longer you wait the worse it can be.</p>"
    },
    {
        "title": "Let Off Some Steam: Three Tips On Proper Bathroom Ventilation",
        "img": "resources/images/blog/Operable-skylight-150x150.jpg",
        "body": "<p>Did you know that more than a pint of moisture is injected into your home during the average shower? If your bathroom is not properly ventilated, that moisture and its potential mold and mildew can compromise the air quality and structural integrity of your home. Don’t worry, Bizzy B Plumbing & Home Improvement will “B” there for you.</p><br /><p>Here are three tips on proper bathroom ventilation:</p><br /><ol><li>Operable Windows Offer Natural Venting:</li><ul><li>Ventilating your bath can be a esthetically pleasing experience.  Operable windows not only ventilate, but also provide design value, views and natural daylight and help balance the air pressure in your home.</li><li>You do not have to be an extrovert to use windows into your bath. Simple inside window shutters allow airflow and modesty to work in conjunction. Look for shutters made of composite materials to prevent warping commonly associated with wood and moisture combination.</li><li>Operable skylights are another way to introduce natural light, and vent moist air out. If you have a skylight that is out of arm’s reach, consider adding a motorized option to ensure you take full advantage of its function.</li><li>A door from your bath to the outside can be a big change that also provides lots of fresh air. If your bathroom does not have deck or ground access, you could still have doors with a Juliet balcony (a false balcony utilizing a railing mounted outside the doors with no true walkout).</li></ul><li>Install Exhaust Fans, Mechanical ventilation is not like it used to be:</li><ul><li>Call us to be sure your bath fan is sized properly for your bath before you purchase one. If you are unsure, we can pick one out for you and install it. We can also verify that it’s properly vented to the exterior.<li>Exhaust fans are essential to properly remove moisture (and the occasional bad smells) from your bath. Look for Energy Star rated exhaust fans, which ensure energy efficient, effective, and quiet operation. Many newer models have motion sensors and or moisture sensors to automate the process for you.</li><li>Exhaust Fan Timers for your bath exhaust fans should stay on for at least 30 minutes after showers to effectively remove excess moisture from your bathroom. A fan equipped with a timer will ensure the fan remains on as long as needed to exhaust moisture. Most timers have settings for the length of operation to insure removal of leftover moisture. Call us to be sure your bath fan is sized properly for your bath before you purchase one. If you are unsure, we can pick one out for you and install it. We can also verify that it’s properly vented to the exterior. Exhaust fans are essential to properly remove moisture (and the occasional bad smells) from your bath. Look for Energy Star rated exhaust fans, which ensure energy efficient, effective, and quiet operation. Many newer models have motion sensors and or moisture sensors to automate the process for you.</li><li>Exhaust Fan Timers for your bath exhaust fans should stay on for at least 30 minutes after showers to effectively remove excess moisture from your bathroom. A fan equipped with a timer will ensure the fan remains on as long as needed to exhaust moisture. Most timers have settings for the length of operation to insure removal of leftover moisture.</li></ul><li>Use a dehumidifier:</li><ul><li>Dehumidifiers can remove large amount of excess moisture from the home but can be constant strain. They require frequent emptying and are usually bulky and not esthetically pleasing.  They are however an easy alternative to new installations.</li></ul></ol>"
    },
    {
        "title": "Guide To Understand The Costs Involved In Your Remodel",
        "img": "resources/images/blog/Cost-vs.-Value-2014-Knoxville-TN-Remodeling.jpg",
        "body": "<p>Many Knoxville/Maryville home owners have called asking about remodeling projects for their home. The areas of remodel in question include: finishing a basement, kitchen remodels, bathroom remodels, and new or replacement decks. This usually follows by the question of how much.></p><br /><p>Home owners typically do not have a great deal of experience with these things, and feel a bit “in the dark” when it come to pricing comparing a remodel. Bizzy B Plumbing & Home Improvement would like to make this a bit easier with some helpful tips and price comparisons.</p><br /><p>Home owners all want to know how the pieces fit together. The design, product selections, demo, framing, drywall, electrical, plumbing, inspections and much more all effect the process and price.</p><br /><p>So, How much will it cost?</p><br /><p>The problem with phone estimate figures is the idea that a remodel is an item like a appliance or TV, but it’s not. We need to sit down with you and see what it is you are really wanting.</p><br /><p>Some things are more pricey than others. Carpentry, for instance, is an art. It is a skilled trade and needed heavily in Kitchen remodels.</p><br /><p>Some companies may sell a new bathroom “system,” but that isn’t a custom renovation project. And the “systems” usually do not work the way it is shown on TV.</p><br /><p>No two projects or remodels are the same. The design, and the choices you make will determine the overall cost of your project.</p><br /><p><strong>Tip 1:</strong> Ask for a price range. This is a reasonable request, just understand what those numbers mean. Know the pitfalls with this method:</p><ul><li>Low price: Sounds completely do-able but this will not account for hidden issues as the remodel begins, nor will it account for the possible costs of materials being delayed to the site.</li><li>High price: Holy $%*!, is the most common reaction. This is an over estimate of the worst case scenario. Do not let this scare you away, but you need to be aware what it could be if hidden issues are found.</li></ul><p><strong>Tip 2:</strong> Where to start getting price ideas.</p><br /><p>Remodeling Magazine’s Cost vs. Value Report for the Knoxville area is a great place to get an idea of what you will spend and what you will recoup on the sale of your home.</p><br />Cost vs. Value 2014  Knoxville, TN  Remodeling<br /><p><strong>Tip 3:</strong> Watch some of the remodeling shows on TV for ideas you would like tot see incorporated into the design of your newly remodeled space. This can be from small space saving ideas to large automation projects.</p>"
    }
]